<a href="https://colab.research.google.com/github/sanjogmish/Ted-Talk-Views-Prediction/blob/main/Feature_engineering_Ted.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [587]:
import pandas as pd
import numpy as np

In [588]:
df = pd.read_csv('/content/drive/MyDrive/Capstone 3 Regression/data_ted_talks.csv')

In [589]:
df.head(5).T

                                                                0  ...                                                  4
talk_id                                                         1  ...                                                 66
title                                 Averting the climate crisis  ...                        Do schools kill creativity?
speaker_1                                                 Al Gore  ...                                   Sir Ken Robinson
all_speakers                                       {0: 'Al Gore'}  ...                            {0: 'Sir Ken Robinson'}
occupations                             {0: ['climate advocate']}  ...                        {0: ['author', 'educator']}
about_speakers  {0: 'Nobel Laureate Al Gore focused the world’...  ...  {0: "Creativity expert Sir Ken Robinson challe...
views                                                     3523392  ...                                           65051954
recorded_date                                          2006-02-25  ...                                         2006-02-25
published_date                                         2006-06-27  ...                                         2006-06-27
event                                                     TED2006  ...                                            TED2006
native_lang                                                    en  ...                                                 en
available_lang  ['ar', 'bg', 'cs', 'de', 'el', 'en', 'es', 'fa...  ...  ['af', 'ar', 'az', 'be', 'bg', 'bn', 'ca', 'cs...
comments                                                      272  ...                                               4931
duration                                                      977  ...                                               1164
topics          ['alternative energy', 'cars', 'climate change...  ...  ['children', 'creativity', 'culture', 'dance',...
related_talks   {243: 'New thinking on the climate crisis', 54...  ...  {865: 'Bring on the learning revolution!', 173...
url             https://www.ted.com/talks/al_gore_averting_the...  ...  https://www.ted.com/talks/sir_ken_robinson_do_...
description     With the same humor and humanity he exuded in ...  ...  Sir Ken Robinson makes an entertaining and pro...
transcript      Thank you so much, Chris. And it's truly a gre...  ...  Good morning. How are you? (Audience) Good. It...

[19 rows x 5 columns]

In [590]:
df.drop(['talk_id','title','speaker_1','all_speakers','about_speakers','recorded_date','published_date','event','topics','related_talks','url','description',
         'transcript'],axis=1,inplace=True)

In [591]:
df.head(5).T

                                                                0  ...                                                  4
occupations                             {0: ['climate advocate']}  ...                        {0: ['author', 'educator']}
views                                                     3523392  ...                                           65051954
native_lang                                                    en  ...                                                 en
available_lang  ['ar', 'bg', 'cs', 'de', 'el', 'en', 'es', 'fa...  ...  ['af', 'ar', 'az', 'be', 'bg', 'bn', 'ca', 'cs...
comments                                                      272  ...                                               4931
duration                                                      977  ...                                               1164

[6 rows x 5 columns]

In [592]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4005 entries, 0 to 4004
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   occupations     3483 non-null   object
 1   views           4005 non-null   int64
 2   native_lang     4005 non-null   object
 3   available_lang  4005 non-null   object
 4   comments        3350 non-null   float64
 5   duration        4005 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 187.9+ KB

In [593]:
# REPLACING NULL VALUES IN 'OCCUPATIONS' WITH 'EMPTY'
df['occupations'] = np.where(df['occupations'].isnull(),'Empty',df['occupations'])

# REPLACING NULL VALUES IN 'COMMENTS' WITH MEDIAN VALUE
df['comments'] = np.where(df['comments'].isnull(),df['comments'].median(),df['comments'])

In [594]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4005 entries, 0 to 4004
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   occupations     4005 non-null   object
 1   views           4005 non-null   int64
 2   native_lang     4005 non-null   object
 3   available_lang  4005 non-null   object
 4   comments        4005 non-null   float64
 5   duration        4005 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 187.9+ KB

In [595]:
# APPLYING EVAL FUNCTION TO 'occupations' , 'available_lang'
df['occupations'] = df['occupations'].apply(lambda x: eval(x) if x!='Empty' else 'Empty')

df['available_lang'] = df['available_lang'].apply(lambda x: eval(x))

In [596]:
df['occupations']

0                           {0: ['climate advocate']}
1       {0: ['global health expert; data visionary']}
2                       {0: ['technology columnist']}
3         {0: ['activist for environmental justice']}
4                         {0: ['author', 'educator']}
                            ...
4000                         {0: ['health activist']}
4001                                            Empty
4002                          {0: ['law researcher']}
4003                                            Empty
4004                                            Empty
Name: occupations, Length: 4005, dtype: object

In [597]:
list_of_occupations = list()
for i in range(0,4005):
  if df['occupations'][i] == 'Empty':
    list_of_occupations.append(df['occupations'][i])
  else:
    a = list(df['occupations'][i].items())
    b=list()
    for j in range(len(a)):
      b=b+a[j][1]
    list_of_occupations.append(b)

In [598]:
list_of_occupations_merged = list()
for i in list_of_occupations:
  z = str()
  for j in i:
    z = " ".join([z,j])
  list_of_occupations_merged.append(z)

In [599]:
df['occupations_cleaned'] = list_of_occupations_merged

In [600]:
df.drop(['occupations'],axis=1,inplace=True)

In [601]:
df.head(5)

      views native_lang  ... duration                    occupations_cleaned
0   3523392          en  ...      977                       climate advocate
1  14501685          en  ...     1190   global health expert; data visionary
2   1920832          en  ...     1286                   technology columnist
3   2664069          en  ...     1116     activist for environmental justice
4  65051954          en  ...     1164                        author educator

[5 rows x 6 columns]

In [602]:
num_of_languages = list()
for i in df['available_lang']:
    num_of_languages.append(len(i))

In [603]:
df['num_of_languages'] = num_of_languages

In [604]:
df.drop(['available_lang'],axis=1,inplace=True)

In [605]:
df.head(5)

      views  ... num_of_languages
0   3523392  ...               43
1  14501685  ...               49
2   1920832  ...               26
3   2664069  ...               35
4  65051954  ...               62

[5 rows x 6 columns]

In [606]:
def remove_punctuation(text):
    import string
    translator = str.maketrans('', '', string.punctuation)
    return text.translate(translator)

In [607]:
df['occupations_cleaned'] = df['occupations_cleaned'].apply(remove_punctuation)

In [608]:
import nltk
nltk.download('stopwords')
from nltk.corpus import stopwords

[nltk_data] Downloading package stopwords to /root/nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

In [609]:
sw = stopwords.words('english')
def stopwords(text):
    text = [word.lower() for word in text.split() if word.lower() not in sw]
    return " ".join(text)

In [610]:
df['occupations_cleaned'] = df['occupations_cleaned'].apply(stopwords)

In [611]:
df.head(5)

      views native_lang  ...                  occupations_cleaned  num_of_languages
0   3523392          en  ...                     climate advocate                43
1  14501685          en  ...  global health expert data visionary                49
2   1920832          en  ...                 technology columnist                26
3   2664069          en  ...       activist environmental justice                35
4  65051954          en  ...                      author educator                62

[5 rows x 6 columns]

**SPLITING INTO TRAIN AND TEST DATASETS**

In [612]:
from sklearn.model_selection import train_test_split

X = df.iloc[:,1:]
y = df.iloc[:,0]

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=10)

**APPLYING TF-IDF VECTORIZER**

In [613]:
from sklearn.feature_extraction.text import TfidfVectorizer
tfidf_vect = TfidfVectorizer(ngram_range=(1, 1),min_df = 30 , max_df = 0.9)

vec_occupations = tfidf_vect.fit_transform(X_train['occupations_cleaned']).toarray()

In [614]:
vec_occupations_test = tfidf_vect.transform(X_test['occupations_cleaned']).toarray()

In [615]:
vec_occupations.shape

(3204, 27)

In [616]:
tfidf_vect2 = TfidfVectorizer()
vec_native_lang =  tfidf_vect2.fit_transform(X_train['native_lang']).toarray()
vec_native_lang_test = tfidf_vect2.transform(X_test['native_lang']).toarray()

In [617]:
vec_native_lang.shape

(3204, 12)

In [618]:
vec_occupations_df = pd.DataFrame(vec_occupations,index = X_train.index)
vec_native_lang_df = pd.DataFrame(vec_native_lang,index = X_train.index)

In [619]:
vec_native_lang_df

       0    1    2    3    4    5    6    7    8    9    10   11
3872  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
1598  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
3177  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
1114  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
2973  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
...   ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...
3441  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
1344  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
527   0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
3197  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
1289  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0

[3204 rows x 12 columns]

In [620]:
frames = [X_train,vec_occupations_df,vec_native_lang_df]
X_train = pd.concat(frames,axis=1)

In [621]:
X_train.drop(['occupations_cleaned','native_lang'],axis=1,inplace=True)

In [622]:
vec_occupations_test_df = pd.DataFrame(vec_occupations_test,index = X_test.index)
vec_native_lang_test_df = pd.DataFrame(vec_native_lang_test,index = X_test.index)

frames2 = [X_test,vec_occupations_test_df,vec_native_lang_test_df]
X_test = pd.concat(frames2,axis=1)

In [623]:
X_test.drop(['occupations_cleaned','native_lang'],axis=1,inplace=True)

# **MODELLING**

In [626]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
X_train = scaler.fit_transform(X_train)

X_test = scaler.transform(X_test)

/usr/local/lib/python3.7/dist-packages/sklearn/utils/validation.py:1679: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  FutureWarning,
/usr/local/lib/python3.7/dist-packages/sklearn/utils/validation.py:1679: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  FutureWarning,
/usr/local/lib/python3.7/dist-packages/sklearn/utils/validation.py:1679: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  FutureWarning,

In [627]:
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score
from sklearn.model_selection import GridSearchCV,cross_validate,RandomizedSearchCV
from sklearn.linear_model import Ridge
from sklearn.linear_model import Lasso
from sklearn.linear_model import ElasticNet

In [628]:
regressor = LinearRegression()
regressor.fit(X_train,y_train)

y_train_pred = regressor.predict(X_train)
y_pred = regressor.predict(X_test)

r2_score(y_train,y_train_pred)

0.3023701687270185

In [629]:
r2_score(y_test,y_pred)

-6.779144673398985e+22